#include <iostream>  //вмикаємо бібліотеку для вводу-виводу

int main() { // початок головної функції

	//Types of variables in C++

	

    int num = 13;    // оголошення змінної num типу int
    std::cout << "Initial value of num: " << num << std::endl;  // виведення початкового значення

    num = 5;  // переприсвоєння нового значення змінній num
    std::cout << "New value of num: " << num << std::endl;  // виведення нового значення

	int a, b;  // оголошення двох змінних a та b    
	std::cout << "Enter variable a: ";  // запит на введення значення змінної a
	std::cin >> a; // зчитування значення змінної a з консолі

	std::cout << "Enter variable b: ";  // запит на введення значення змінної b
	std::cin >> b; // зчитування значення змінної b з консолі

	std::cout << "A: " << a << ". B: " << b << std::endl;  // виведення суми змінних a та b

	std::cout << "Sum of A and B: " << a + b << std::endl; // виведення суми змінних a та b


	//short - короткі цілі числа (short)
	// int - цілі числа (integer)
	// long - довгі цілі числа (long)
	short num1 = 9; // використовує 2 байта можна від -32768 до 32767
	int num2 = 5; // використовує 4 байта можна від -2147483648 до 2147483647 (2bilion)
	long num3 = 7; // використовує 8 байт можна від -9223372036854775808 до 9223372036854775807 (9trillion)

	unsigned short num4 = 9; // використовує 2 байта можна від 0 до 65535
	unsigned int num5 = 5; // використовує 4 байта можна від 0 до 4294967295 (4bilion)
	unsigned long num6 = 7; // використовує 8 байт можна від 0 до 18446744073709551615 (18trillion)


	// float і double - числа з плаваючою комою (float and double)
	float num7 = 5.2337552f; // використовує 4 байта, може зберігати числа з плаваючою комою (до 7 знаків точності) в кінці потрібно додати f але це не обов'язково
	double num8 = 543.393570562432452f; // використовує 8 байт, може зберігати числа з плаваючою комою (до 15 знаків точності)

	// char - символи (char)
	char sym = 'B'; // символи (char) використовує 1 байт, може зберігати один символ (такі як 'A', 'b', '1', '!', тощо)

	// bool - логічний тип (bool)
	bool isHappy = true; // логічний тип (bool) використовує 1 байт, може бути true або false

	return 0;  // повернення 0, що означає успішне завершення програми

}
